# Development Tools
brew "gh"           # GitHub CLI
brew "go"           # Go programming language
brew "node"         # Node.js LTS
brew "neovim"       # Modern Vim
brew "lazygit"      # Git TUI
brew "jq"           # JSON processor
brew "tmux"         # Terminal multiplexer
brew "tmuxinator"   # Tmuxinator
brew "docker"       # Docker CLI
brew "kubectl"      # Kubernetes CLI
brew "nvm"          # Node version manager
brew "parallel"     # Parallel

# CLI Utilities & System Tools
brew "ripgrep"      # Fast grep alternative
brew "fd"           # Fast find alternative
brew "awk"          # Awk
brew "fzf"          # Fuzzy finder
brew "bat"          # Better cat
brew "lsd"          # Better ls
brew "btop"         # System monitor
brew "fastfetch"    # System info
brew "trash"        # Safe rm
brew "wget"         # Download utility
brew "curl"         # Data transfer tool
brew "tree"         # Directory tree visualization
brew "rsync"        # File synchronization

# Fun CLI Tools
brew "cmatrix"      # Matrix screensaver
brew "cowsay"       # Cowsay
brew "lolcat"       # Rainbow text
brew "figlet"       # ASCII art text
brew "fortune"      # Random quotes

# Productivity Apps
cask "alfred"              # Spotlight replacement
cask "rectangle"           # Window manager
cask "bitwarden"           # Password manager
cask "selfcontrol"         # Time management
cask "appcleaner"          # Uninstaller
cask "yubico-authenticator" # YubiKey Authenticator
cask "superkey"            # SuperKey

# Development Apps
cask "cursor"             # AI code editor
cask "visual-studio-code" # Code editor
cask "sublime-text"       # Code editor
cask "github"             # GitHub Desktop
cask "ghostty"            # Terminal
cask "orbstack"           # Docker alternative
cask "tableplus"          # Database client

# Media & Design
cask "iina"               # Media player
cask "obs"                # OBS Studio
cask "shottr"             # Screenshot tool
cask "handbrake"          # Video transcoder
cask "imageoptim"         # Image optimizer
cask "pika"               # Color picker
cask "affinity-photo"     # Photo editor
cask "paintbrush"         # Simple image editor

# Communication
cask "legcord"            # Discord alternative
cask "slack"              # Work communication

# Browsers & Downloads
cask "firefox"            # Browser
cask "google-chrome"      # Browser
cask "qbittorrent"        # Torrent client

# System Utilities
cask "mos"                # Mouse utility
cask "balenaetcher"       # Flash OS images
