# Development Tools
brew "gh"           # GitHub CLI
brew "go"           # Go programming language
brew "node"         # Node.js LTS
brew "neovim"       # Modern Vim
brew "lazygit"      # Git TUI
brew "jq"           # JSON processor
brew "tmux"         # Terminal multiplexer
brew "tmuxinator"   # Tmuxinator
brew "wireguard-tools" # WireGuard CLI tools

# System Utilities
brew "bat"          # Better cat
brew "lsd"          # Better ls
brew "btop"         # System monitor
brew "fastfetch"    # System info
brew "trash"        # Safe rm
brew "wget"         # Download utility

# Fun
brew "cmatrix"      # Matrix screensaver
brew "cowsay"       # Cowsay
brew "lolcat"       # Lolcat
brew "figlet"       # Figlet
brew "fortune"      # Fortune

# Productivity Apps
cask "alfred"              # Spotlight replacement
cask "rectangle"           # Window manager
cask "bitwarden"          # Password manager
cask "selfcontrol"        # Time management
cask "appcleaner"         # Uninstaller
cask "paintbrush"          # Image editor
cask "yubico-authenticator" # YubiKey Authenticator
cask "superkey"            # SuperKey

# Development Apps
cask "cursor"             # AI code editor
cask "visual-studio-code" # Code editor
cask "github"             # GitHub Desktop
cask "ghostty"            # Terminal
cask "orbstack"           # Docker alternative
cask "tableplus"          # Database client
cask "sublime-text"       # Code editor

# Media & Communication
cask "iina"               # Media player
cask "legcord"            # Discord alternative
cask "obs"                # OBS Studio
cask "slack"              # Work communication
cask "shottr"             # Screenshot tool
cask "handbrake"          # Video transcoder
cask "imageoptim"         # Image optimizer
cask "pika"               # Color picker
cask "affinity-photo"     # Photo editor

# Browsers & Downloads
cask "firefox"            # Browser
cask "google-chrome"      # Browser
cask "qbittorrent"        # Torrent client

# System Utilities
cask "mos"                # Mouse utility
