# Development Tools
brew "gh"           # GitHub CLI
brew "go"           # Go programming language
brew "php"          # PHP programming languag
brew "composer"     # PHP package mangager
brew "node"         # Node.js LTS
brew "oven-sh/bun/bun"          # Fast JavaScript runtime
brew "lua"          # Lua programming language
brew "neovim"       # Modern Vim
brew "bob"          # Neovim package manager
brew "lazygit"      # Git TUI
brew "jq"           # JSON processor
brew "docker"       # Docker CLI
brew "kubectl"      # Kubernetes CLI
brew "nvm"          # Node version manager
brew "parallel"     # Parallel
brew "sqlite"       # SQLite database
brew "nmap"         # Network scanner
brew "tldr"         # Collaborative cheatsheets for console commands

# CLI Utilities & System Tools
brew "ripgrep"      # Fast grep alternative
brew "fd"           # Fast find alternative
brew "awk"          # Awk
brew "fzf"          # Fuzzy finder
brew "bat"          # Better cat
brew "lsd"          # Better ls
brew "btop"         # System monitor
brew "fastfetch"    # System info
brew "trash"        # Safe rm
brew "wget"         # Download utility
brew "curl"         # Data transfer tool
brew "tree"         # Directory tree visualization
brew "rsync"        # File synchronization
brew "ffmpeg"       # Video converter
brew "kanata"       # Software keyboard remapper

# Zsh & Shell Enhancements
brew "zsh"                      # Modern shell
brew "zsh-autosuggestions"      # Command autosuggestions
brew "zsh-syntax-highlighting"  # Syntax highlighting
brew "zsh-completions"          # Additional completions
brew "zsh-vi-mode"              # Vi mode for zsh

# Fun CLI Tools
brew "cmatrix"      # Matrix screensaver
brew "cowsay"       # Cowsay
brew "lolcat"       # Rainbow text
brew "figlet"       # ASCII art text
brew "fortune"      # Random quotes
brew "sshpass"      # SSH password authentication

# Productivity Apps
cask "sensiblesidebuttons" # Utilise mouse side navigation buttons
cask "anki"                # Memory training application
cask "audacity"            # Multi-track audio editor and recorder
cask "alfred"              # Spotlight replacement
cask "rectangle"           # Window manager
cask "bitwarden"           # Password manager
cask "selfcontrol"         # Time management
cask "appcleaner"          # Uninstaller
cask "yubico-authenticator" # YubiKey Authenticator
cask "superkey"            # SuperKey
cask "caffeine"            # Keep screen awake
cask "moom"                # Window manager
cask "shortcat"            # Shortcat
cask "audio-hijack"       # Records audio from any application

# Development Apps
cask "cursor"             # AI code editor
cask "visual-studio-code" # Code editor
cask "sublime-text"       # Code editor
cask "github"             # GitHub Desktop
cask "ghostty"            # Terminal
cask "orbstack"           # Docker alternative
cask "tableplus"          # Database client

# Media & Design
cask "iina"               # Media player
cask "obs"                # OBS Studio
cask "shottr"             # Screenshot tool
cask "handbrake"          # Video transcoder
cask "imageoptim"         # Image optimizer
cask "pika"               # Color picker
cask "affinity-photo"     # Photo editor
cask "paintbrush"         # Simple image editor

# Communication
cask "legcord"            # Discord alternative
cask "slack"              # Work communication

# Browsers & Downloads
cask "firefox@developer-edition"  # Firefox Developer Edition
cask "google-chrome"      # Browser
cask "qbittorrent"        # Torrent client

# System Utilities
cask "mos"                # Mouse utility
cask "balenaetcher"       # Flash OS images
